
## Terraform plan for environment: `prep`

**Commit:** cf3e19f18812f43975aadedd9eee7227ca55c1c6


**API version:** cf3e19f188
**CLI version:** cf3e19f188
**Selfserve version:** release-v6.1.4
**Internal version:** 94f1a9e0de

### Plan summary

`57 to add, 66 to change, 36 to destroy`

**🆕 Creates**

```tf
module.service.aws_lb_listener_rule.proving["pdf-converter"]
module.service.aws_lb_target_group.this["pdf-converter"]
module.service.module.ecs_cluster["pdf-converter"].aws_cloudwatch_log_group.this[0]
module.service.module.ecs_cluster["pdf-converter"].aws_ecs_cluster.this[0]
module.service.module.ecs_cluster["pdf-converter"].aws_iam_policy.task_exec[0]
module.service.module.ecs_cluster["pdf-converter"].aws_iam_role.task_exec[0]
module.service.module.ecs_cluster["pdf-converter"].aws_iam_role_policy_attachment.task_exec[0]
module.service.module.ecs_service["api"].aws_ecs_task_definition.this[0]
module.service.module.ecs_service["internal"].aws_ecs_task_definition.this[0]
module.service.module.ecs_service["pdf-converter"].aws_appautoscaling_policy.this["cpu"]
module.service.module.ecs_service["pdf-converter"].aws_appautoscaling_policy.this["memory"]
module.service.module.ecs_service["pdf-converter"].aws_appautoscaling_target.this[0]
module.service.module.ecs_service["pdf-converter"].aws_ecs_service.this[0]
module.service.module.ecs_service["pdf-converter"].aws_ecs_task_definition.this[0]
module.service.module.ecs_service["pdf-converter"].aws_iam_policy.task_exec[0]
module.service.module.ecs_service["pdf-converter"].aws_iam_role.task_exec[0]
module.service.module.ecs_service["pdf-converter"].aws_iam_role.tasks[0]
module.service.module.ecs_service["pdf-converter"].aws_iam_role_policy.tasks[0]
module.service.module.ecs_service["pdf-converter"].aws_iam_role_policy_attachment.task_exec[0]
module.service.module.ecs_service["selfserve"].aws_ecs_task_definition.this[0]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-clean-up-variations-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-close-expired-windows-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-cns-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-company-profile-dlq-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-create-psv-licence-surrender-task-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-digital-continuation-reminders-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-duplicate-vehicle-removal-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-duplicate-vehicle-warning-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-enqueue-ch-compare-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-expire-bus-registration-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-flag-urgent-tasks-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-inspection-request-email-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-interim-end-date-enforcement-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-international-goods-export-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-last-tm-letter-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-licence-status-rules-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-mark-expired-permits-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-company-profile-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-inbox-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-insolvency-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-insolvency-dlq-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-ntu-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-queue-community-licences-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-queue-disc-generation-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-queue-disc-print-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-queue-ecmt-accept-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-queue-general-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-queue-irhp-allocate-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-queue-permit-generation-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-queue-permit-print-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-queue-print-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-psv-operator-list-export-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-remove-read-audit-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-resolve-payments-0"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-transxchange-consumer-0"]
module.service.module.sns_batch_failure.aws_sns_topic_subscription.this["vol-app-prep-batch-failure-email-dvsa.tss-support+prep_olcs_jobs"]
module.service.module.ecs_service["pdf-converter"].module.container_definition["pdf-converter"].aws_cloudwatch_log_group.this[0]
```
**🗑️ Deletes**

```tf
null_resource.deployed_versions
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-clean-up-variations"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-close-expired-windows"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-cns"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-company-profile-dlq"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-create-psv-licence-surrender-task"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-digital-continuation-reminders"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-duplicate-vehicle-removal"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-duplicate-vehicle-warning"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-enqueue-ch-compare"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-expire-bus-registration"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-flag-urgent-tasks"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-inspection-request-email"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-interim-end-date-enforcement"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-international-goods-export"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-last-tm-letter"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-licence-status-rules"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-mark-expired-permits"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-company-profile"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-inbox"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-insolvency"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-insolvency-dlq"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-ntu"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-queue-community-licences"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-queue-disc-generation"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-queue-disc-print"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-queue-ecmt-accept"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-queue-general"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-queue-irhp-allocate"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-queue-permit-generation"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-queue-permit-print"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-process-queue-print"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-psv-operator-list-export"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-remove-read-audit"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-resolve-payments"]
module.service.module.eventbridge.aws_scheduler_schedule.this["prep-transxchange-consumer"]
```
**📖 Reads**

```tf
module.service.module.ecs_service["api"].data.aws_caller_identity.current
module.service.module.ecs_service["api"].data.aws_ecs_task_definition.this[0]
module.service.module.ecs_service["api"].data.aws_iam_policy_document.task_exec[0]
module.service.module.ecs_service["api"].data.aws_iam_policy_document.task_exec_assume[0]
module.service.module.ecs_service["api"].data.aws_iam_policy_document.tasks[0]
module.service.module.ecs_service["api"].data.aws_iam_policy_document.tasks_assume[0]
module.service.module.ecs_service["api"].data.aws_partition.current
module.service.module.ecs_service["api"].data.aws_region.current
module.service.module.ecs_service["internal"].data.aws_caller_identity.current
module.service.module.ecs_service["internal"].data.aws_ecs_task_definition.this[0]
module.service.module.ecs_service["internal"].data.aws_iam_policy_document.task_exec[0]
module.service.module.ecs_service["internal"].data.aws_iam_policy_document.task_exec_assume[0]
module.service.module.ecs_service["internal"].data.aws_iam_policy_document.tasks[0]
module.service.module.ecs_service["internal"].data.aws_iam_policy_document.tasks_assume[0]
module.service.module.ecs_service["internal"].data.aws_partition.current
module.service.module.ecs_service["internal"].data.aws_region.current
module.service.module.ecs_service["pdf-converter"].data.aws_caller_identity.current
module.service.module.ecs_service["pdf-converter"].data.aws_ecs_task_definition.this[0]
module.service.module.ecs_service["pdf-converter"].data.aws_iam_policy_document.task_exec[0]
module.service.module.ecs_service["pdf-converter"].data.aws_iam_policy_document.task_exec_assume[0]
module.service.module.ecs_service["pdf-converter"].data.aws_iam_policy_document.tasks[0]
module.service.module.ecs_service["pdf-converter"].data.aws_iam_policy_document.tasks_assume[0]
module.service.module.ecs_service["pdf-converter"].data.aws_partition.current
module.service.module.ecs_service["pdf-converter"].data.aws_region.current
module.service.module.ecs_service["selfserve"].data.aws_caller_identity.current
module.service.module.ecs_service["selfserve"].data.aws_ecs_task_definition.this[0]
module.service.module.ecs_service["selfserve"].data.aws_iam_policy_document.task_exec[0]
module.service.module.ecs_service["selfserve"].data.aws_iam_policy_document.task_exec_assume[0]
module.service.module.ecs_service["selfserve"].data.aws_iam_policy_document.tasks[0]
module.service.module.ecs_service["selfserve"].data.aws_iam_policy_document.tasks_assume[0]
module.service.module.ecs_service["selfserve"].data.aws_partition.current
module.service.module.ecs_service["selfserve"].data.aws_region.current
module.service.module.eventbridge.data.aws_iam_policy_document.additional_inline[0]
module.service.module.ecs_service["api"].module.container_definition["api"].data.aws_region.current
module.service.module.ecs_service["internal"].module.container_definition["internal"].data.aws_region.current
module.service.module.ecs_service["pdf-converter"].module.container_definition["pdf-converter"].data.aws_region.current
module.service.module.ecs_service["selfserve"].module.container_definition["selfserve"].data.aws_region.current
```
**🔄 Updates**

```tf
module.service.aws_cloudwatch_dashboard.services
module.service.module.batch.aws_batch_job_definition.this["cancel-unsubmitted-bilateral"]
module.service.module.batch.aws_batch_job_definition.this["ch-vs-olcs-diffs"]
module.service.module.batch.aws_batch_job_definition.this["clean-up-variations"]
module.service.module.batch.aws_batch_job_definition.this["close-expired-windows"]
module.service.module.batch.aws_batch_job_definition.this["cns"]
module.service.module.batch.aws_batch_job_definition.this["company-profile-dlq"]
module.service.module.batch.aws_batch_job_definition.this["create-psv-licence-surrender-task"]
module.service.module.batch.aws_batch_job_definition.this["data-retention-delete"]
module.service.module.batch.aws_batch_job_definition.this["data-retention-populate"]
module.service.module.batch.aws_batch_job_definition.this["data-retention-postcheck"]
module.service.module.batch.aws_batch_job_definition.this["data-retention-precheck"]
module.service.module.batch.aws_batch_job_definition.this["database-maintenance"]
module.service.module.batch.aws_batch_job_definition.this["digital-continuation-reminders"]
module.service.module.batch.aws_batch_job_definition.this["duplicate-vehicle-removal"]
module.service.module.batch.aws_batch_job_definition.this["duplicate-vehicle-warning"]
module.service.module.batch.aws_batch_job_definition.this["enqueue-ch-compare"]
module.service.module.batch.aws_batch_job_definition.this["expire-bus-registration"]
module.service.module.batch.aws_batch_job_definition.this["flag-urgent-tasks"]
module.service.module.batch.aws_batch_job_definition.this["import-anondb"]
module.service.module.batch.aws_batch_job_definition.this["import-users-from-csv"]
module.service.module.batch.aws_batch_job_definition.this["inspection-request-email"]
module.service.module.batch.aws_batch_job_definition.this["interim-end-date-enforcement"]
module.service.module.batch.aws_batch_job_definition.this["international-goods-export"]
module.service.module.batch.aws_batch_job_definition.this["last-tm-letter"]
module.service.module.batch.aws_batch_job_definition.this["licence-status-rules"]
module.service.module.batch.aws_batch_job_definition.this["mark-expired-permits"]
module.service.module.batch.aws_batch_job_definition.this["ni-compliance"]
module.service.module.batch.aws_batch_job_definition.this["populate-anondb"]
module.service.module.batch.aws_batch_job_definition.this["process-cl"]
module.service.module.batch.aws_batch_job_definition.this["process-company-profile"]
module.service.module.batch.aws_batch_job_definition.this["process-inbox"]
module.service.module.batch.aws_batch_job_definition.this["process-insolvency"]
module.service.module.batch.aws_batch_job_definition.this["process-insolvency-dlq"]
module.service.module.batch.aws_batch_job_definition.this["process-ntu"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-community-licences"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-disc-generation"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-disc-print"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-ecmt-accept"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-general"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-irhp-allocate"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-permit-generation"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-permit-print"]
module.service.module.batch.aws_batch_job_definition.this["process-queue-print"]
module.service.module.batch.aws_batch_job_definition.this["psv-operator-list-export"]
module.service.module.batch.aws_batch_job_definition.this["remove-read-audit"]
module.service.module.batch.aws_batch_job_definition.this["resolve-payments"]
module.service.module.batch.aws_batch_job_definition.this["sas-mi-extract"]
module.service.module.batch.aws_batch_job_definition.this["system-parameter"]
module.service.module.batch.aws_batch_job_definition.this["transxchange-consumer"]
module.service.module.ecs_service["api"].aws_ecs_service.this[0]
module.service.module.ecs_service["api"].aws_iam_policy.task_exec[0]
module.service.module.ecs_service["api"].aws_iam_role.task_exec[0]
module.service.module.ecs_service["api"].aws_iam_role.tasks[0]
module.service.module.ecs_service["api"].aws_iam_role_policy.tasks[0]
module.service.module.ecs_service["internal"].aws_ecs_service.this[0]
module.service.module.ecs_service["internal"].aws_iam_policy.task_exec[0]
module.service.module.ecs_service["internal"].aws_iam_role.task_exec[0]
module.service.module.ecs_service["internal"].aws_iam_role.tasks[0]
module.service.module.ecs_service["internal"].aws_iam_role_policy.tasks[0]
module.service.module.ecs_service["selfserve"].aws_ecs_service.this[0]
module.service.module.ecs_service["selfserve"].aws_iam_policy.task_exec[0]
module.service.module.ecs_service["selfserve"].aws_iam_role.task_exec[0]
module.service.module.ecs_service["selfserve"].aws_iam_role.tasks[0]
module.service.module.ecs_service["selfserve"].aws_iam_role_policy.tasks[0]
module.service.module.eventbridge.aws_iam_policy.additional_inline[0]
```


----

<details data-gh-workflow="prep-environment-plan"><summary>Show full plan</summary>

```tf


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # null_resource.deployed_versions must be replaced
-/+ resource "null_resource" "deployed_versions" {
      ~ id       = "8927049424171271314" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "deployed_api_image_tag"       = "release-v6.1.4" -> "cf3e19f188"
          ~ "deployed_cli_image_tag"       = "release-v6.1.4" -> "cf3e19f188"
          ~ "deployed_internal_image_tag"  = "release-v6.1.4" -> "94f1a9e0de"
            # (2 unchanged elements hidden)
        }
    }

  # module.service.aws_cloudwatch_dashboard.services will be updated in-place
  ~ resource "aws_cloudwatch_dashboard" "services" {
      ~ dashboard_body = jsonencode(
          ~ {
              ~ widgets = [
                    # (5 unchanged elements hidden)
                    {
                        height     = 5
                        properties = {
                            legend   = {
                                position = "right"
                            }
                            liveData = false
                            metrics  = [
                                [
                                    {
                                        expression = "mm0m2"
                                        id         = "expr1m2"
                                        label      = "vol-app-prep-internal-cluster"
                                        region     = "eu-west-1"
                                    },
                                ],
                                [
                                    {
                                        expression = "mm0m3"
                                        id         = "expr1m3"
                                        label      = "vol-app-prep-api-cluster"
                                        region     = "eu-west-1"
                                    },
                                ],
                                [
                                    {
                                        expression = "mm0m6"
                                        id         = "expr1m6"
                                        label      = "vol-app-prep-selfserve-cluster"
                                        region     = "eu-west-1"
                                    },
                                ],
                                [
                                    "ECS/ContainerInsights",
                                    "ServiceCount",
                                    "ClusterName",
                                    "vol-app-prep-internal-cluster",
                                    {
                                        id      = "mm0m2"
                                        region  = "eu-west-1"
                                        visible = false
                                    },
                                ],
                                [
                                    "...",
                                    "vol-app-prep-api-cluster",
                                    {
                                        id      = "mm0m3"
                                        region  = "eu-west-1"
                                        visible = false
                                    },
                                ],
                                [
                                    "...",
                                    "vol-app-prep-selfserve-cluster",
                                    {
                                        id      = "mm0m6"
                                        region  = "eu-west-1"
                                        visible = false
                                    },
                                ],
                            ]
                            period   = 300
                            region   = "eu-west-1"
                            stacked  = false
                            stat     = "Average"
                            timezone = "UTC"
                            title    = "Service Count"
                            view     = "timeSeries"
                            yAxis    = {
                                left = {
                                    label     = "Count"
                                    showUnits = false
                                }
                            }
                        }
                        type       = "metric"
                        width      = 8
                        x          = 16
                        y          = 5
                    },
                  ~ {
                      ~ properties = {
                          ~ metrics = [
                                # (1 unchanged element hidden)
                                [
                                    "AWS/ApplicationELB",
                                    "ActiveConnectionCount",
                                    "LoadBalancer",
                                    "app/APPPP-OLCS-PRI-IUWEB-ALB/e454e4ecdb50bf03",
                                    {
                                        label = "APPPP-OLCS-PRI-IUWEB-ALB"
                                    },
                                ],
                              + [
                                  + "AWS/ApplicationELB",
                                  + "ActiveConnectionCount",
                                  + "LoadBalancer",
                                  + "app/APPPP-OLCS-PRI-SVCS-ALB/708b9e321e09651c",
                                  + {
                                      + label = "APPPP-OLCS-PRI-SVCS-ALB"
                                    },
                                ],
                                [
                                    "AWS/ApplicationELB",
                                    "ActiveConnectionCount",
                                    "LoadBalancer",
                                    "app/APPPP-OLCS-PUB-SSWEB-ALB/481a40891def89be",
                                    {
                                        label = "APPPP-OLCS-PUB-SSWEB-ALB"
                                    },
                                ],
                            ]
                            # (4 unchanged attributes hidden)
                        }
                        # (5 unchanged attributes hidden)
                    },
                  ~ {
                      ~ properties = {
                          ~ metrics = [
                                # (1 unchanged element hidden)
                                [
                                    "AWS/ApplicationELB",
                                    "HTTPCode_ELB_4XX_Count",
                                    "LoadBalancer",
                                    "app/APPPP-OLCS-PRI-IUWEB-ALB/e454e4ecdb50bf03",
                                    {
                                        label = "APPPP-OLCS-PRI-IUWEB-ALB"
                                    },
                                ],
                              + [
                                  + "AWS/ApplicationELB",
                                  + "HTTPCode_ELB_4XX_Count",
                                  + "LoadBalancer",
                                  + "app/APPPP-OLCS-PRI-SVCS-ALB/708b9e321e09651c",
                                  + {
                                      + label = "APPPP-OLCS-PRI-SVCS-ALB"
                                    },
                                ],
                                [
                                    "AWS/ApplicationELB",
                                    "HTTPCode_ELB_4XX_Count",
                                    "LoadBalancer",
                                    "app/APPPP-OLCS-PUB-SSWEB-ALB/481a40891def89be",
                                    {
                                        label = "APPPP-OLCS-PUB-SSWEB-ALB"
                                    },
                                ],
                            ]
                            # (4 unchanged attributes hidden)
                        }
                        # (5 unchanged attributes hidden)
                    },
                  ~ {
                      ~ properties = {
                          ~ metrics = [
                                # (1 unchanged element hidden)
                                [
                                    "AWS/ApplicationELB",
                                    "HTTPCode_ELB_5XX_Count",
                                    "LoadBalancer",
                                    "app/APPPP-OLCS-PRI-IUWEB-ALB/e454e4ecdb50bf03",
                                    {
                                        label = "APPPP-OLCS-PRI-IUWEB-ALB"
                                    },
                                ],
                              + [
                                  + "AWS/ApplicationELB",
                                  + "HTTPCode_ELB_5XX_Count",
                                  + "LoadBalancer",
                                  + "app/APPPP-OLCS-PRI-SVCS-ALB/708b9e321e09651c",
                                  + {
                                      + label = "APPPP-OLCS-PRI-SVCS-ALB"
                                    },
                                ],
                                [
                                    "AWS/ApplicationELB",
                                    "HTTPCode_ELB_5XX_Count",
                                    "LoadBalancer",
                                    "app/APPPP-OLCS-PUB-SSWEB-ALB/481a40891def89be",
                                    {
                                        label = "APPPP-OLCS-PUB-SSWEB-ALB"
                                    },
                                ],
                            ]
                            # (4 unchanged attributes hidden)
                        }
                        # (5 unchanged attributes hidden)
                    },
                  ~ {
                      ~ properties = {
                          ~ metrics = [
                                # (1 unchanged element hidden)
                                [
                                    "AWS/ApplicationELB",
                                    "RequestCount",
                                    "LoadBalancer",
                                    "app/APPPP-OLCS-PRI-IUWEB-ALB/e454e4ecdb50bf03",
                                    {
                                        label = "APPPP-OLCS-PRI-IUWEB-ALB"
                                    },
                                ],
                              + [
                                  + "AWS/ApplicationELB",
                                  + "RequestCount",
                                  + "LoadBalancer",
                                  + "app/APPPP-OLCS-PRI-SVCS-ALB/708b9e321e09651c",
                                  + {
                                      + label = "APPPP-OLCS-PRI-SVCS-ALB"
                                    },
                                ],
                                [
                                    "AWS/ApplicationELB",
                                    "RequestCount",
                                    "LoadBalancer",
                                    "app/APPPP-OLCS-PUB-SSWEB-ALB/481a40891def89be",
                                    {
                                        label = "APPPP-OLCS-PUB-SSWEB-ALB"
                                    },
                                ],
                            ]
                            # (4 unchanged attributes hidden)
                        }
                        # (5 unchanged attributes hidden)
                    },
                ]
            }
        )
        id             = "vol-app-prep"
        # (2 unchanged attributes hidden)
    }

  # module.service.aws_lb_listener_rule.proving["pdf-converter"] will be created
  + resource "aws_lb_listener_rule" "proving" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = "arn:aws:elasticloadbalancing:eu-west-1:146997448015:listener/app/APPPP-OLCS-PRI-SVCS-ALB/708b9e321e09651c/72b340b1c43c2500"
      + priority     = 90
      + tags_all     = {
          + "Environment" = "prep"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {
          + host_header {
              + values = [
                  + "*",
                ]
            }
        }
    }

  # module.service.aws_lb_target_group.this["pdf-converter"] will be created
  + resource "aws_lb_target_group" "this" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "vol-app-prep-pdf-converter-tg"
      + name_prefix                        = (known after apply)
      + port                               = 8080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = {
          + "Environment" = "prep"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-9b62fffe"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 300
          + matcher             = "200-499"
          + path                = "/healthcheck"
          + port                = "8080"
          + protocol            = "HTTP"
          + timeout             = 60
          + unhealthy_threshold = 2
        }

      + stickiness (known after apply)

      + target_failover (known after apply)

      + target_group_health (known after apply)

      + target_health_state (known after apply)
    }

  # module.service.module.batch.aws_batch_job_definition.this["cancel-unsubmitted-bilateral"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-cancel-unsubmitted-bilateral:61" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.1.4" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "cf3e19f188"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.1.4" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:cf3e19f188"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-cancel-unsubmitted-bilateral:61"
        name                       = "vol-app-prep-cancel-unsubmitted-bilateral"
      ~ revision                   = 61 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["ch-vs-olcs-diffs"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-ch-vs-olcs-diffs:61" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.1.4" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "cf3e19f188"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.1.4" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:cf3e19f188"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-ch-vs-olcs-diffs:61"
        name                       = "vol-app-prep-ch-vs-olcs-diffs"
      ~ revision                   = 61 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["clean-up-variations"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-clean-up-variations:61" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.1.4" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "cf3e19f188"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.1.4" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:cf3e19f188"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-clean-up-variations:61"
        name                       = "vol-app-prep-clean-up-variations"
      ~ revision                   = 61 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["close-expired-windows"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-close-expired-windows:61" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.1.4" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "cf3e19f188"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.1.4" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:cf3e19f188"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-close-expired-windows:61"
        name                       = "vol-app-prep-close-expired-windows"
      ~ revision                   = 61 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["cns"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-cns:61" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.1.4" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "cf3e19f188"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.1.4" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:cf3e19f188"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-cns:61"
        name                       = "vol-app-prep-cns"
      ~ revision                   = 61 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["company-profile-dlq"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-company-profile-dlq:61" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.1.4" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "cf3e19f188"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.1.4" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:cf3e19f188"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-company-profile-dlq:61"
        name                       = "vol-app-prep-company-profile-dlq"
      ~ revision                   = 61 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["create-psv-licence-surrender-task"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-create-psv-licence-surrender-task:61" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.1.4" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "cf3e19f188"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.1.4" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:cf3e19f188"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-create-psv-licence-surrender-task:61"
        name                       = "vol-app-prep-create-psv-licence-surrender-task"
      ~ revision                   = 61 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["data-retention-delete"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-data-retention-delete:61" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.1.4" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "cf3e19f188"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.1.4" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:cf3e19f188"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-data-retention-delete:61"
        name                       = "vol-app-prep-data-retention-delete"
      ~ revision                   = 61 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["data-retention-populate"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-data-retention-populate:61" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.1.4" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "cf3e19f188"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.1.4" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:cf3e19f188"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-data-retention-populate:61"
        name                       = "vol-app-prep-data-retention-populate"
      ~ revision                   = 61 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["data-retention-postcheck"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-data-retention-postcheck:61" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.1.4" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "cf3e19f188"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.1.4" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:cf3e19f188"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-data-retention-postcheck:61"
        name                       = "vol-app-prep-data-retention-postcheck"
      ~ revision                   = 61 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["data-retention-precheck"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-data-retention-precheck:61" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.1.4" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "cf3e19f188"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.1.4" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:cf3e19f188"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-data-retention-precheck:61"
        name                       = "vol-app-prep-data-retention-precheck"
      ~ revision                   = 61 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["database-maintenance"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-database-maintenance:61" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.1.4" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "cf3e19f188"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.1.4" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:cf3e19f188"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-database-maintenance:61"
        name                       = "vol-app-prep-database-maintenance"
      ~ revision                   = 61 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["digital-continuation-reminders"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-digital-continuation-reminders:61" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.1.4" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "cf3e19f188"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.1.4" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:cf3e19f188"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-digital-continuation-reminders:61"
        name                       = "vol-app-prep-digital-continuation-reminders"
      ~ revision                   = 61 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["duplicate-vehicle-removal"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-duplicate-vehicle-removal:4" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.1.4" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "cf3e19f188"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.1.4" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:cf3e19f188"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-duplicate-vehicle-removal:4"
        name                       = "vol-app-prep-duplicate-vehicle-removal"
      ~ revision                   = 4 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["duplicate-vehicle-warning"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-duplicate-vehicle-warning:61" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.1.4" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "cf3e19f188"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.1.4" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:cf3e19f188"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-duplicate-vehicle-warning:61"
        name                       = "vol-app-prep-duplicate-vehicle-warning"
      ~ revision                   = 61 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["enqueue-ch-compare"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-enqueue-ch-compare:61" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.1.4" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "cf3e19f188"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.1.4" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:cf3e19f188"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-enqueue-ch-compare:61"
        name                       = "vol-app-prep-enqueue-ch-compare"
      ~ revision                   = 61 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["expire-bus-registration"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-expire-bus-registration:61" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.1.4" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "cf3e19f188"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.1.4" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:cf3e19f188"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-expire-bus-registration:61"
        name                       = "vol-app-prep-expire-bus-registration"
      ~ revision                   = 61 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["flag-urgent-tasks"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-flag-urgent-tasks:61" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.1.4" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "cf3e19f188"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.1.4" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:cf3e19f188"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-flag-urgent-tasks:61"
        name                       = "vol-app-prep-flag-urgent-tasks"
      ~ revision                   = 61 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["import-anondb"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-import-anondb:67" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  - {
                      - name  = "APP_VERSION"
                      - value = "release-v6.1.4"
                    },
                  - {
                      - name  = "DOMAIN"
                      - value = "dvsacloud.uk"
                    },
                    {
                        name  = "ENVIRONMENT_NAME"
                        value = "PP"
                    },
                    {
                        name  = "FULL_DOMAIN"
                        value = "prep.olcs.dvsacloud.uk"
                    },
                  + {
                      + name  = "DOMAIN"
                      + value = "dvsacloud.uk"
                    },
                  + {
                      + name  = "READDB_HOST"
                      + value = "olcsreaddb-rds.pre.olcs.dvsacloud.uk"
                    },
                    {
                        name  = "PROXY"
                        value = "proxy.prep.olcs.dvsacloud.uk:3128"
                    },
                  + {
                      + name  = "APP_VERSION"
                      + value = "cf3e19f188"
                    },
                    {
                        name  = "READDB_HOST"
                        value = "olcsreaddb-rds.prep.olcs.dvsacloud.uk"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.1.4" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:cf3e19f188"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-import-anondb:67"
        name                       = "vol-app-prep-import-anondb"
      ~ revision                   = 67 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["import-users-from-csv"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-import-users-from-csv:61" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.1.4" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "cf3e19f188"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.1.4" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:cf3e19f188"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-import-users-from-csv:61"
        name                       = "vol-app-prep-import-users-from-csv"
      ~ revision                   = 61 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["inspection-request-email"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-inspection-request-email:61" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.1.4" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "cf3e19f188"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.1.4" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:cf3e19f188"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-inspection-request-email:61"
        name                       = "vol-app-prep-inspection-request-email"
      ~ revision                   = 61 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["interim-end-date-enforcement"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-interim-end-date-enforcement:61" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.1.4" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "cf3e19f188"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.1.4" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:cf3e19f188"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-interim-end-date-enforcement:61"
        name                       = "vol-app-prep-interim-end-date-enforcement"
      ~ revision                   = 61 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["international-goods-export"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-international-goods-export:61" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.1.4" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "cf3e19f188"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.1.4" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:cf3e19f188"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-international-goods-export:61"
        name                       = "vol-app-prep-international-goods-export"
      ~ revision                   = 61 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["last-tm-letter"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-last-tm-letter:61" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.1.4" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "cf3e19f188"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.1.4" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:cf3e19f188"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-last-tm-letter:61"
        name                       = "vol-app-prep-last-tm-letter"
      ~ revision                   = 61 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["licence-status-rules"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-licence-status-rules:61" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.1.4" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "cf3e19f188"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.1.4" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:cf3e19f188"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-licence-status-rules:61"
        name                       = "vol-app-prep-licence-status-rules"
      ~ revision                   = 61 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["mark-expired-permits"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-mark-expired-permits:61" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  ~ {
                      ~ name  = "APP_VERSION" -> "ENVIRONMENT_NAME"
                      ~ value = "release-v6.1.4" -> "PP"
                    },
                  ~ {
                      ~ name  = "ENVIRONMENT_NAME" -> "APP_VERSION"
                      ~ value = "PP" -> "cf3e19f188"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.1.4" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:cf3e19f188"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-mark-expired-permits:61"
        name                       = "vol-app-prep-mark-expired-permits"
      ~ revision                   = 61 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["ni-compliance"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-ni-compliance:67" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  - {
                      - name  = "APP_VERSION"
                      - value = "release-v6.1.4"
                    },
                  - {
                      - name  = "DOMAIN"
                      - value = "dvsacloud.uk"
                    },
                    {
                        name  = "ENVIRONMENT_NAME"
                        value = "PP"
                    },
                    {
                        name  = "FULL_DOMAIN"
                        value = "prep.olcs.dvsacloud.uk"
                    },
                  + {
                      + name  = "DOMAIN"
                      + value = "dvsacloud.uk"
                    },
                  + {
                      + name  = "READDB_HOST"
                      + value = "olcsreaddb-rds.pre.olcs.dvsacloud.uk"
                    },
                    {
                        name  = "PROXY"
                        value = "proxy.prep.olcs.dvsacloud.uk:3128"
                    },
                  + {
                      + name  = "APP_VERSION"
                      + value = "cf3e19f188"
                    },
                    {
                        name  = "READDB_HOST"
                        value = "olcsreaddb-rds.prep.olcs.dvsacloud.uk"
                    },
                ]
              ~ image                        = "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:release-v6.1.4" -> "146997448015.dkr.ecr.eu-west-1.amazonaws.com/vol-app/cli:cf3e19f188"
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (7 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-ni-compliance:67"
        name                       = "vol-app-prep-ni-compliance"
      ~ revision                   = 67 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["populate-anondb"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:146997448015:job-definition/vol-app-prep-populate-anondb:67" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  - {
                      - name  = "APP_VERSION"
                      - value = "release-v6.1.4"
                    },
                  - {
                     ... (truncated, see full plan in the workflow run logs)
```

</details>